% Copyright 2026 The MathWorks, Inc.
%% データの読み取り
% (1) readtable関数を使ってファイル「ball_bouncing.csv」を読み取ってみましょう。
% 読み取るデータは変数「data」に格納します。
data = 

%% データの確認
% (2) ワークスペースで名前「data」をダブルクリックして、中身を確認してみましょう。

%% プロット
% (3) dataテーブルの時間「Time」列と位置「Position」列をプロットしましょう。
% ヒント：テーブルデータ「data」の「col1」列と「col2」列をプロットするには
% plot(data, 'col1', 'col2') と書きます。

%% プロットの重ね描き 
% (4) 座標軸をホールドして、
% 時間「Time」列と速さ「Velocity」列のプロットを重ね描きします。
% ヒント：座標軸をホールドするにはhold onと書きます。

%% ホールドの解除
hold off

% 凡例表示
legend({'位置', '速さ'})
